/*********************************************************************************/
/* 色々とチェックプログラム                                                      */
/*                                         designed by hamayan since 2009/05/21  */
/*********************************************************************************/
//#include  "mul_tsk.h"
#include  "derivertive.h"
#include  "peripheral.h"
#include  "arcnet.h"

/*************************************************************************/
/* その他の定義                                                          */
/*************************************************************************/

/*************************************************************************/
/* 大域変数宣言                                                          */
/*************************************************************************/

/*************************************************************************/
/* プロトタイプ宣言                                                      */
/*************************************************************************/

/*************************************************************************/
/* 端子定義                                                              */
/*************************************************************************/

/*************************************************************************/
/* 外部 ARCNET初期化 0x68000000                                          */
/* アクセスは16bit単位とする。                                           */
/*************************************************************************/
void arcInit( void )
{
  volatile short temp;
//  volatile short *arc;

  /*ARCNET RESET*/
  //ARC_RST_IS_0;
  //Dly100us( 10 * 10 );  /*10ms*/
  //ARC_RST_IS_1;

  /*c-bus領域に書込みアクセスし、ARCNETコントローラにバスタイプを判断させる*/
  *((volatile short *)0x6C000000) = 0;

  /**/
  temp = ARC_ADR_STATUS;

  ARC_ADR_SUB_ADR = 5;
  ARC_ADR_BUSCTRL = 0x80;
  temp = ARC_ADR_BUSCTRL;

  temp = ARC_ADR_STATUS;

  ARC_ADR_SUB_ADR = 1;
  ARC_ADR_NODEID = 0x55;
  temp = ARC_ADR_NODEID;
  ARC_ADR_NODEID = 0xaa;
  temp = ARC_ADR_NODEID;
  ARC_ADR_NODEID = 0x12;
  temp = ARC_ADR_NODEID;
  ARC_ADR_NODEID = 0x34;
  temp = ARC_ADR_NODEID;
}

/*************************************************************************/
/* 外部 ARCNETチェック 0x68000000                                        */
/* アクセスは16bit単位とする。                                           */
/*************************************************************************/
int arcBufferCheck( void )
{
  int i;
//  volatile short *arc;
  short arc_buf[1024];

  ARC_ADR_ADR_U = 0x00 + 0x40 + 0;
  ARC_ADR_ADR_D = 0 + 0x00;
  for( i = 0; i < 1024; i++ )
  {
    ARC_ADR_DATA = (volatile short)i;
  }

  ARC_ADR_ADR_U = 0x80 + 0x40 + 0;
  ARC_ADR_ADR_D = 0 + 0x00;
  for( i = 0; i < 1024; i++ )
  {
    arc_buf[i] = ARC_ADR_DATA;
  }

  for( i = 0; i < 1024; i++ )
  {
    if(arc_buf[i] != (volatile short)i)
      return (-1);
  }

  return 0;
}

/*********************************************************************************/
/* end of file                                                                   */
/*                                         designed by hamayan since 2009/05/21  */
/*********************************************************************************/
